Repository: alexisnomine/sharepoint-activedirectory-editor
Catalog: ADUserEditorWebpart/Resources/ADUserEditorWebpart.*.resx
Languages: fr_fr, nl_nl

# lgApply
source: Apply
fr_fr: Appliquer
nl_nl: Toepassen

# lgCancel
source: Cancel
fr_fr: Annuler
nl_nl: Annuleren

# lgDefaultPropertiesConf
source: <properties><property adname='displayName' name='Full Name' type='readonly' /><property adname='thumbnailPhoto' name='Photo' type='image' /><property adname='sn' name='Last Name' type='textbox' /><property adname='givenName' name='First Name' type='textbox' /><property adname='manager' name='Manager' type='person' /><property adname='assistant' name='Assistant' type='person' /><property adname='department' name='Service' type='listbox' values="IT;Human Resources;Bio;Security" /><property adname='title' name='Title' type='textbox' /><property adname='employeeType' name="Employee Type" type='dropdown' values='Technician,tech;Manager,mgr;Director,dir' /><property adname='telephoneNumber' name='Telephone number' type='textbox' /><property adname='otherTelephone' name="Other phone numbers" type='multitextbox' values="4" /><property adname='mobile' name='Mobile' type='textbox' /><property adname='facsimileTelephoneNumber' name='Fax' type='textbox' /><property adname='l' name='Town' type='dropdown' values='New-York;Washington' /><property adname='physicalDeliveryOfficeName' name='Office' type='textbox' /><property adname='company' name='Company' type='textbox' /><property adname='accountExpires' name='End of contract' type='date' /><property adname='extensionCustomAttribute1' name="Certifications" type='checkboxlist' values='Cisco,CIS;Microsoft,MIC;Oracle,ORA' /></properties>
fr_fr: <properties><property adname='displayName' name='Nom complet' type='readonly' /><property adname='thumbnailPhoto' name='Photo' type='image' /><property adname='sn' name='Nom' type='textbox' /><property adname='givenName' name='Prénom' type='textbox' /><property adname='manager' name='Responsable' type='person' /><property adname='assistant' name='Assistant(e)' type='person' /><property adname='department' name='Service' type='listbox' values="Accueil;Achats;Administration;Brevets;Ressources Humaines;Systèmes d'Information" /><property adname='title' name='Titre' type='textbox' /><property adname='employeeType' name="Type d'employé" type='dropdown' values='Cadre,cadre;Technicien,technicien;Ouvrier,OE' /><property adname='telephoneNumber' name='Téléphone' type='textbox' /><property adname='otherTelephone' name="Autres téléphones" type='multitextbox' values="4" /><property adname='mobile' name='Portable' type='textbox' /><property adname='facsimileTelephoneNumber' name='Fax' type='textbox' /><property adname='l' name='Ville' type='dropdown' values='Pessac;Vénissieux;Washington' /><property adname='physicalDeliveryOfficeName' name='Bureau' type='textbox' /><property adname='company' name='Entreprise' type='textbox' /><property adname='accountExpires' name='Date de départ' type='date' /><property adname='extensionCustomAttribute1' name="Certifications" type='checkboxlist' values='Cisco,CIS;Microsoft,MIC;Oracle,ORA' /></properties>

# lgDomainControllers
source: Active Directory Controller(s)
fr_fr: Contrôleur(s) Active Directory

# lgEditCancelled
source: Editing has been cancelled!
fr_fr: Les modifications ont été annulées!
nl_nl: Bewerken is geannuleerd!

# lgPropertiesDefinition
source: User Properties
fr_fr: Definition des Propriétés
nl_nl: Gebuiker eigenschappen

# lgSelectUserToEdit
source: Please select an User to Edit
fr_fr: Veuillez sélectionner un utilisateur à modifier
nl_nl: Selecteer een gebruiker om aan te passen

# lgSelfService
source: Edit current user only
fr_fr: Modifier uniquement l'utilisateur courant
nl_nl: Alleen huidige gebruiker aanpassen

# lgUserFound
source: User found!
fr_fr: Utilisateur trouvé !
nl_nl: Gebruiker gevonden!

# lgUserNotFound
source: User not found!
fr_fr: Utilisateur non trouvé !
nl_nl: Gebruiker niet gevonden!

# lgUserNotSelected
source: Please enter a valid name!
fr_fr: Merci d'entrer correctement le nom !
nl_nl: Voer a.u.b. een correcte naam in!

# lgUserSelection
source: User Selection
fr_fr: Sélection de l'utilisateur à modifier
nl_nl: Gebruiker selectie

# lgUserUpdated
source: Profile updated! (24h to Sync with SharePoint)
fr_fr: Profil mis à jour! (Les modifications apparaîtront dans SharePoint sous 24h)
nl_nl: Profiel is geüpdatet! (24u om te syncen met SharePoint)

# lgValidate
source: Select
fr_fr: Valider
nl_nl: Selecteer

# WebPartDescription
source: AD User Editor is a WebPart that allows to edit easily any user profile attribute in Active Directory trough a customizable form. (version 2.1.3)
fr_fr: Webpart permettant de modifier facilement presque n'importe quelle propriété de profil des utilisateurs Active Directory. (version 2.1.3)
nl_nl: Webpart that allows to easily modify any profile property of any person in Active Directory. (version 2.1.1)

# lgClear
source: Clear
fr_fr: Effacer
nl_nl: Verwijderen

# lgImgConstraints
source: (Max. 2 Mo, Jpeg only, will be resized to 128x128px)
fr_fr: (Max. 2 Mo, Jpeg uniquement, sera redimensionée à 128x128px)
nl_nl: (Max. 2 Mb, alleen JPEG afbeeldingen, wordt verkleind naar 128px bij 128px)

# lgImgTooLarge
source: Image too large (>2 Mo)
fr_fr: Image trop large (>2 Mo)
nl_nl: De afbeelding is te groot (groter dan 2MB)

# lgImgWrongFormat
source: Wrong image format :
fr_fr: Mauvais type d'image :
nl_nl: Fout afbeeldingsformaat:

# lgConfigurationNeeded
source: AD User Editor needs to be configured
fr_fr: AD User Editor a besoin d'être configuré

# lgConfiguration
source: Configuration
nl_nl: Configuratie
